In [6]:
import numpy as np  
import pandas as pd 
df=pd.read_csv('/home/ullu/Documents/client_Data.csv', header=0)
df

,id,first_name,last_name,email,gender,app_name,currency,Age
0,1,Ines,Jouhandeau,NaN,Female,Keylex,"€303,59",79.0
1,2,Ara,Oxtaby,aoxtaby1@businessweek.com,Female,Span,"€515,63",NaN
2,3,Linnie,Castagne,lcastagne2@paypal.com,Female,Andalax,"€467,60",17.0
3,4,Cecilia,Klimpke,cklimpke3@furl.net,Female,Otcom,"€806,80",21.0
4,5,Everard,Runnalls,erunnalls4@digg.com,Male,Stronghold,NaN,3.0
...,...,...,...,...,...,...,...,...
995,996,Shawn,Sunter,ssunterrn@drupal.org,Female,Stringtough,"€789,77",74.0
996,997,Rhody,Darley,rdarleyro@chronoengine.com,Female,Cardguard,NaN,27.0
997,998,Ezmeralda,Lathey,NaN,Female,Gembucket,NaN,63.0
998,999,Vittoria,Ashmore,vashmorerq@twitter.com,Female,Solarbreeze,"€548,63",57.0
999,1000,Joyous,Kristiansen,jkristiansenrr@google.ca,Female,Prodder,NaN,73.0

In [12]:
headers=df.columns.values
for x in headers:
    x.lower()
    print(x)

id
first_name
last_name
email
gender
app_name
currency
Age

In [8]:
df_sort_surname=df.sort_values(by=['last_name','first_name'])
df_sort_surname

,id,first_name,last_name,email,gender,app_name,currency,Age
421,422,La verne,Adamovich,ladamovichbp@networkadvertising.org,Female,Sub-Ex,"€192,52",77.0
148,149,Arluene,Adran,aadran44@nifty.com,Female,Treeflex,NaN,NaN
612,613,Sharona,Ailmer,sailmerh0@infoseek.co.jp,Female,Pannier,NaN,50.0
116,117,Alano,Aird,NaN,Male,Stim,NaN,52.0
937,938,Mikaela,Aire,maireq1@themeforest.net,Female,Flexidy,"€420,43",67.0
...,...,...,...,...,...,...,...,...
439,440,Devland,Zannini,dzanninic7@tumblr.com,Male,Viva,"€239,16",64.0
360,361,Illa,Zettler,izettlera0@nba.com,Female,Bytecard,NaN,88.0
560,561,Rollie,Zisneros,rzisnerosfk@hatena.ne.jp,Male,Opela,"€381,53",NaN
28,29,Ethelyn,de Guerre,NaN,Female,Transcof,NaN,46.0
729,730,Lock,de Lloyd,ldelloydk9@dagondesign.com,Male,Job,NaN,79.0

In [19]:
#missing data 
df.dtypes.value_counts()
df_na=df.fillna("missing")
df_na

,id,first_name,last_name,email,gender,app_name,currency,Age
0,1,Ines,Jouhandeau,missing,Female,Keylex,"€303,59",79
1,2,Ara,Oxtaby,aoxtaby1@businessweek.com,Female,Span,"€515,63",missing
2,3,Linnie,Castagne,lcastagne2@paypal.com,Female,Andalax,"€467,60",17
3,4,Cecilia,Klimpke,cklimpke3@furl.net,Female,Otcom,"€806,80",21
4,5,Everard,Runnalls,erunnalls4@digg.com,Male,Stronghold,missing,3
...,...,...,...,...,...,...,...,...
995,996,Shawn,Sunter,ssunterrn@drupal.org,Female,Stringtough,"€789,77",74
996,997,Rhody,Darley,rdarleyro@chronoengine.com,Female,Cardguard,missing,27
997,998,Ezmeralda,Lathey,missing,Female,Gembucket,missing,63
998,999,Vittoria,Ashmore,vashmorerq@twitter.com,Female,Solarbreeze,"€548,63",57
999,1000,Joyous,Kristiansen,jkristiansenrr@google.ca,Female,Prodder,missing,73

In [20]:
df.interpolate()

,id,first_name,last_name,email,gender,app_name,currency,Age
0,1,Ines,Jouhandeau,NaN,Female,Keylex,"€303,59",79.0
1,2,Ara,Oxtaby,aoxtaby1@businessweek.com,Female,Span,"€515,63",48.0
2,3,Linnie,Castagne,lcastagne2@paypal.com,Female,Andalax,"€467,60",17.0
3,4,Cecilia,Klimpke,cklimpke3@furl.net,Female,Otcom,"€806,80",21.0
4,5,Everard,Runnalls,erunnalls4@digg.com,Male,Stronghold,NaN,3.0
...,...,...,...,...,...,...,...,...
995,996,Shawn,Sunter,ssunterrn@drupal.org,Female,Stringtough,"€789,77",74.0
996,997,Rhody,Darley,rdarleyro@chronoengine.com,Female,Cardguard,NaN,27.0
997,998,Ezmeralda,Lathey,NaN,Female,Gembucket,NaN,63.0
998,999,Vittoria,Ashmore,vashmorerq@twitter.com,Female,Solarbreeze,"€548,63",57.0
999,1000,Joyous,Kristiansen,jkristiansenrr@google.ca,Female,Prodder,NaN,73.0

In [15]:


gender_table=pd.pivot_table(df_sort_surname,values=['Age'],index=['gender'])
gender_table

              Age
gender
Female  50.522222
Male    51.640091